In [20]:
import pandas as pd

In [21]:
dataframe = pd.read_csv("https://raw.githubusercontent.com/guilhermeonrails/data-jobs/refs/heads/main/salaries.csv")

In [22]:
dataframe.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2025.0,SE,FT,Solutions Engineer,214000,USD,214000,US,100,US,M
1,2025.0,SE,FT,Solutions Engineer,136000,USD,136000,US,100,US,M
2,2025.0,MI,FT,Data Engineer,158800,USD,158800,AU,0,AU,M
3,2025.0,MI,FT,Data Engineer,139200,USD,139200,AU,0,AU,M
4,2025.0,EN,FT,Data Engineer,90000,USD,90000,US,0,US,M

In [23]:
dataframe.info()

<class 'pandas.DataFrame'>
RangeIndex: 133349 entries, 0 to 133348
Data columns (total 11 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   work_year           133339 non-null  float64
 1   experience_level    133349 non-null  str
 2   employment_type     133349 non-null  str
 3   job_title           133349 non-null  str
 4   salary              133349 non-null  int64
 5   salary_currency     133349 non-null  str
 6   salary_in_usd       133349 non-null  int64
 7   employee_residence  133349 non-null  str
 8   remote_ratio        133349 non-null  int64
 9   company_location    133349 non-null  str
 10  company_size        133349 non-null  str
dtypes: float64(1), int64(3), str(7)
memory usage: 11.2 MB

In [24]:
dataframe.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='str')

In [25]:
dataframe = dataframe.rename(columns={"work_year": "ano", "experience_level": "experiencia_profissional", "employment_type": "modalidade_trabalho", "job_title": "cargo_trabalho", "salary": "remuneração", "salary_currency": "moeda_salario", "salary_in_usd": "remuneração_em_dolares", "employee_residence": "residencia_funcionario", "remote_ratio": "remoto", "company_location": "localizacao_empresa", "company_size": "tamanho_empresa"})

In [26]:
dataframe.describe()

                 ano   remuneração  remuneração_em_dolares         remoto
count  133339.000000  1.333490e+05           133349.000000  133349.000000
mean     2024.358770  1.632833e+05           157617.272098      20.905669
std         0.680627  2.173860e+05            74288.363097      40.590044
min      2020.000000  1.400000e+04            15000.000000       0.000000
25%      2024.000000  1.060200e+05           106000.000000       0.000000
50%      2024.000000  1.470000e+05           146206.000000       0.000000
75%      2025.000000  1.990000e+05           198000.000000       0.000000
max      2025.000000  3.040000e+07           800000.000000     100.000000

In [27]:
dataframe['remuneração_anual'] = dataframe['remuneração'] * 12

In [28]:
dataframe['remuneração_anual'].head()

0    2568000
1    1632000
2    1905600
3    1670400
4    1080000
Name: remuneração_anual, dtype: int64

In [29]:
dataframe.describe()

,ano,remuneração,remuneração_em_dolares,remoto,remuneração_anual
count,133339.000000,1.333490e+05,133349.000000,133349.000000,1.333490e+05
mean,2024.358770,1.632833e+05,157617.272098,20.905669,1.959400e+06
std,0.680627,2.173860e+05,74288.363097,40.590044,2.608632e+06
min,2020.000000,1.400000e+04,15000.000000,0.000000,1.680000e+05
25%,2024.000000,1.060200e+05,106000.000000,0.000000,1.272240e+06
50%,2024.000000,1.470000e+05,146206.000000,0.000000,1.764000e+06
75%,2025.000000,1.990000e+05,198000.000000,0.000000,2.388000e+06
max,2025.000000,3.040000e+07,800000.000000,100.000000,3.648000e+08

In [30]:
dataframe['experiencia_profissional'].value_counts()

experiencia_profissional
SE    77241
MI    40465
EN    12443
EX     3200
Name: count, dtype: int64

In [31]:
dataframe[['remuneração_anual', 'remuneração']].value_counts()

remuneração_anual  remuneração
1920000            160000         2466
1320000            110000         2262
1800000            150000         2189
2160000            180000         1840
1200000            100000         1839
                                  ...
16020000           1335000           1
17400000           1450000           1
1660200            138350            1
5076000            423000            1
4944000            412000            1
Name: count, Length: 11234, dtype: int64

In [32]:
dataframe[['experiencia_profissional', 'cargo_trabalho', 'modalidade_trabalho']].value_counts()

experiencia_profissional  cargo_trabalho             modalidade_trabalho
SE                        Data Scientist             FT                     10917
                          Software Engineer          FT                     10283
                          Data Engineer              FT                      8957
                          Machine Learning Engineer  FT                      5914
                          Engineer                   FT                      5766
                                                                            ...
MI                        Data Engineer              FL                         1
SE                        Finance Data Analyst       FT                         1
                          Computer Vision Engineer   FL                         1
MI                        Principal Data Scientist   FT                         1
EN                        Business Data Analyst      CT                         1
Name: count, Length: 1009, dtype: int64

In [33]:
dataframe.head(10)

,ano,experiencia_profissional,modalidade_trabalho,cargo_trabalho,remuneração,moeda_salario,remuneração_em_dolares,residencia_funcionario,remoto,localizacao_empresa,tamanho_empresa,remuneração_anual
0,2025.0,SE,FT,Solutions Engineer,214000,USD,214000,US,100,US,M,2568000
1,2025.0,SE,FT,Solutions Engineer,136000,USD,136000,US,100,US,M,1632000
2,2025.0,MI,FT,Data Engineer,158800,USD,158800,AU,0,AU,M,1905600
3,2025.0,MI,FT,Data Engineer,139200,USD,139200,AU,0,AU,M,1670400
4,2025.0,EN,FT,Data Engineer,90000,USD,90000,US,0,US,M,1080000
5,2025.0,EN,FT,Data Engineer,80000,USD,80000,US,0,US,M,960000
6,2025.0,SE,FT,Data Scientist,185000,USD,185000,US,0,US,M,2220000
7,2025.0,SE,FT,Data Scientist,148000,USD,148000,US,0,US,M,1776000
8,2025.0,MI,FT,Data Scientist,135000,USD,135000,CA,0,CA,M,1620000
9,2025.0,MI,FT,Data Scientist,108000,USD,108000,CA,0,CA,M,1296000